using System;

namespace Ex4
{
    class Program
    {
      static bool Check(string login, string pass)
        
        static void Main(string[] args)
        {
              //4.Реализовать метод 
              //  проверки логина и пароля.На вход метода подается логин и пароль.
              //  На выходе истина, если прошел авторизацию, и ложь, если не прошел(Логин: root, Password: GeekBrains). 
              //  Используя метод проверки логина и пароля, написать программу: пользователь вводит логин и пароль, 
              //  программа пропускает его дальше или не пропускает.
              //  С помощью цикла do while ограничить ввод пароля тремя попытками.
        }
    }
}
